Repository: GordonZhang2024/flatpak-docs
Catalog: po/*/LC_MESSAGES/first-build.po
Languages: de

source: Building your first Flatpak
de: Erstellen des ersten Flatpaks

source: This tutorial provides a quick introduction to building Flatpaks. In it, you will learn how to create a basic Flatpak application, which can be installed and run.
de: Dieses Tutorial liefert eine schnelle Einführung in die Erstellung von Flatpaks. In diesem lernt man, wie man grundsätzlich eine einfache Flatpak-Anwendung erstellt, die dann installiert und gestartet werden kann.

source: 1. Install a runtime and the matching SDK
de: 1. Installieren einer Laufzeitumgebung und des zugehörigen SDK

source: Flatpak requires every app to specify a runtime that it uses for its basic dependencies. Each runtime has a matching SDK (Software Development Kit), which contains all the things that are in the runtime, plus headers and development tools. This SDK is required to build apps for the runtime.
de: Flatpak fordert von jeder Anwendung, eine Laufzeitumgebung zu spezifizieren, die für es für die Auflösung der grundsätzlichen Abhängigkeiten benötigt. Jede Laufzeitumgebung hat ein zugehöriges SDK (Software Development Kit), das alle Bestandteile der Laufzeitumgebung enthält, sowie Header-Dateien und Entwicklung-Tools. Das SDK wird benötigt, um Anwendungen für die Laufzeitumgebung zu erstellen.

source: 2. Create the app
de: 2. Erstellen der App

source: The app that is going to be created for this tutorial is a simple script. To create it, copy the following::
de: Die Anwendung, die für dieses Tutorial erstellt wird, ist ein einfaches Skript. Um sie zu erstellen, kopiert man Folgendes::

source: Now paste this into an empty file and save it as ``hello.sh``.
de: Dies wird in eine leere Datei eingefügt und als ``hello.sh`` gespeichert.

source: 3. Add a manifest
de: 3. Hinzufügen eines Manifests

source: Each Flatpak is built using a manifest file which provides basic information about the application and instructions for how it is to be built. To add a manifest to the hello world app, add the following to an empty file:
de: Jedes Flatpak wird unter Verwendung einer Manifest-Datei gebaut, dieses enthält grundlegende Informationen über die Anwendung und Instruktionen darüber, wie es gebaut werden soll. Um ein Manifest zu der ``hello world``-anwendung hinzuzufügen, fügt man das Folgende in eine leere Datei ein::

source: In a more complex application, the manifest would list multiple modules. The last one would typically be the application itself, and the earlier ones would be dependencies that are bundled with the app because they are not part of the runtime.
de: In einer komplexeren Anwendung würde das Manifest verschiedene Module auflisten. Das letzte Modul würde standardmäßig die Anwendung selbst sein und die davor aufgelisteten Module würden Abhängigkeiten sein, die mit der Anwendung gebündelt werden, da sie kein Bestandteil der Laufzeitumgebung sind.

source: 4. Build the application
de: 4. Erzeugen der Anwendung

source: Now that the app has a manifest, ``flatpak-builder`` can be used to build it. This is done by specifying the manifest file and a target directory::
de: Nachdem die Anwendung ein Manifest besitzt, kann ``flatpak-builder`` verwendet werden, um sie zu erzeugen. Durchgeführt wird dies, indem ein Zielverzeichnis und die Manifest-Datei angegeben wird::

source: This command will build each module that is listed in the manifest and install it to the ``/app`` subdirectory, inside the ``build-dir`` directory.
de: Dieses Kommando erzeugt jedes Modul, das im Manifest gelistet ist und installiert es, innerhalb des ``build-dir``-Verzeichnisses, in das ``/app``-Unterverzeichnis.

source: 5. Test the build
de: 5. Testen des Builds

source: To verify that the build was successful, run the following::
de: Um zu testen, ob der Build erfolgreich war, verwendet man dieses Kommando::

source: This second time we passed in ``--force-clean``, which means that the previously created ``build-dir`` directory was deleted before the new build was started.
de: Im zweiten Durchlauf haben wir ``--force-clean`` durchgereicht, was bedeutet, dass das zuvor erzeugte ``build-dir``-Verzeichnis gelöscht wurde, bevor der neue Build angestoßen wird.

source: Congratulations, you've made an app!
de: Die erste Anwendung wurde damit erfolgreich erstellt.

source: 6. Put the app in a repository
de: 6. Die Anwendung in ein Repository legen

source: This does the build again, and at the end exports the result to a local directory called ``repo``. Note that ``flatpak-builder`` keeps a cache of previous builds in the ``.flatpak-builder`` subdirectory, so doing a second build like this is very fast.
de: Dies stößt den Build-Prozess erneut an und exportiert das Resultat am Ende in ein lokales Verzeichnis namens ``repo``. Zu beachten ist, dass ``flatpak-builder`` einen Cache behält von vorherigen Builds im ``flatpak-builder``-Unterverzeichnis, somit kann sehr schnell ein zweiter Build, wie dieser, erzeugt werden.

source: 7. Install the app
de: 7. Installieren der Anwendung

source: Now we're ready to add the repository that was just created and install the app. This is done with two commands::
de: Nun ist alles so weit vorbereitet, um das Repository, das eben erstellt wurde, hinzuzufügen und die Anwendung zu installieren. Dies wird mit zwei Kommandos durchgeführt::

source: The first command adds the repository that was created in the previous step. The second command installs the app from the repository.
de: Das erste Kommando fügt das Repository hinzu, das im vorherigen Schritt erzeugt wurde. Das zweite Kommando installiert die Anwendung vom Repository.

source: Both these commands use the ``--user`` argument, which means that the repository and the app are added per-user rather than system-wide. This is useful for testing.
de: Beide Kommandos verwenden das ``--user``-Argument, damit wird das Repository für den jeweiligen Benutzer hinzugefügt – und nicht systemweit. Dies ist sinnvoll für Testläufe.

source: Note that the repository was added with ``--no-gpg-verify``, since a GPG key wasn't specified when the app was built. This is fine for testing, but for official repositories you should sign them with a private GPG key.
de: Hierbei ist zu beachten, dass das Repository mit ``--no-gpg-verify`` hinzugefügt wurde, da kein GPG-Schlüssel spezifiziert wurde, als die Anwendung erzeugt wurde. Dies ist gut zum Testen, aber für offizielle Repositorys sollten diese mit einem privaten GPG-Schlüssel signiert sein.

source: 8. Run the app
de: 8. Starten der Anwendung

source: All that's left is to try the app. This can be done with the following command::
de: Zum Abschluss kann die Anwendung getestet werden. Um dies durchzuführen wird folgendes Kommando eingegeben::

source: This runs the app, so that it prints 'Hello world, from a sandbox'.
de: Das startet die Anwendung und gibt den Text 'Hello world, from a sandbox' aus.
